import { createStyles, makeStyles, Theme } from "@material-ui/core/styles";
import Container from "@material-ui/core/Container";

const useStyles = makeStyles((theme: Theme) =>
  createStyles({
    container: {
      marginTop: theme.spacing(2),
    },
    table: {
      minWidth: 650,
    },
    tableSpace: {
      marginTop: 20,
    },
  })
);

function Home() {
  const classes = useStyles();

  return (
    <div>
      <Container className={classes.container} maxWidth="md">
        <h1 style={{ textAlign: "center" }}>ระบบเวชระเบียนผู้ป่วย</h1>
        <h4><u>Requirements</u></h4>
        <p>
        ระบบประวัติผู้ป่วย เป็นระบบที่ใช้จัดเก็บเวชระเบียนของผู้ป่วย เพื่อให้ผู้ใช้ซึ่งเป็นบุคลากรทาง
        การแพทย์เข้าถึงข้อมูลของผู้ป่วยได้ โดยระบบเวชระเบียนจะสามารถให้เจ้าหน้าที่เวชระเบียนบันทึกข้อมูล
        ผู้ป่วยสำหรับลงทะเบียนเป็นผู้ป่วยในโรงพยาบาลหากไม่เคยรักษาที่โรงพยาบาลนี้มาก่อน เพื่อให้มีข้อมูลอยู่ใน
        ระบบสำหรับการระบุตัวตน เช็คสิทธิการรักษา รวมทั้งตรวจสอบข้อมูลผู้ป่วยเพื่อส่งต่อให้แผนกต่าง ๆ นำ
        ข้อมูลไปใช้ดำเนินการทางการแพทย์ได้ต่อไป โดยหากผู้ป่วยมีข้อมูลในระบบหรือเคยเป็นผู้ป่วยโรงพยาบาลนี้
        มาก่อนอยู่แล้ว จะสามารถใช้ข้อมูลที่เคยลงทะเบียนไว้แล้วได้เลย โดยไม่ต้องลงทะเบียนใหม่ 
        </p>
        <br />
        <h4><u>User Story</u> (ระบบเวชระเบียนผู้ป่วย)</h4>
        <p> 
          <b>ในบทบาทของ</b>	 เจ้าหน้าที่เวชระเบียน<br />
          <b>ฉันต้องการ</b>	ให้ระบบสามารถบันทึกข้อมูลของผู้ป่วยใหม่ที่มาลงทะเบียนได้<br />
          <b>เพื่อ</b>	ใช้ระบุตัวตนผู้ป่วย และให้มีข้อมูลผู้ป่วยเก็บไว้ในระบบ <br />
        </p>
      </Container>
    </div>
  );
}
export default Home;